namespace Content.Shared._Scp.Scp106.Systems;

public abstract class SharedScp106System : EntitySystem
{
    /*
     106
~Обычная скорость передвижения: 2
Смертен, но его количество ХП крайне большое. 5000 тысяч м.б.
Имеет возможность проходить через шлюзы. (замедление скорости вдвое) Дед не может перемещаться через стены.
Имеет возможность перемещаться в рандомные части карты благодаря Экшен с КД в 10 минут. (В представлении дед делает телепорт в какое - то место на станции при этом он должен визуально появляться выходя из - под земли совместно со спрайтом).
Боевка. Дед должен не убивать, а трогать, перемещая в бекрумс.
При движении издает специфический саунд своего перемещения. (если останавливается, звук тоже заканчивается)
     */
}
